public class PleaseReadMe {
    /*
    Уважаемый, ревьювер, доброго времени суток.
    Скорее всего, то что я так обращаюсь к Вам так - неправильно, и так делать нельзя.
    Однако, сегодня последний день 4 спринта (28.01.2024), и я сижу на работе, дописываю этот код уже 5-ый день.
    Это ОГРОМНАЯ работа, на выполнение которой, как мне кажется, нам дали незаслуженно короткие сроки.
    2 недели на один такой важный спринт, где важна и теория, которую обязательно нужно понять, для дальнейшей работы,
    и просто так не хотелось бы прокликивать теорию, что бы поскорее дойти до проекта.
    На этот проект я выделил практически ~неделю, и всё равно только сейчас, минут 10 назад окончил его выполнение.
    Он оказался огромным, каких еще не было в практикуме.

    Теория в этом спринте была ужасной, всё поверхностно объяснено и тяжело понимать что пытаются донести, какими-то обрывками,
    без подробных и наглядных объяснений, в связи с чем приходилось просто уходить искать материал в другом месте.
    Проблема тут только в одном, разумеется - во времени, которого и так практически нет.

    Этот проект я доделал, он рабочий, оба тестовых сценария которые необходимо было проверить, и для обоих браузеров.
    Я постарался выстроить конструкцию всех кодов максимально аккуратно и подробно описать практически все элементы системы,
    для удобства чтения и понимая кода, несмотря на то, что в требованиях было "разделить на тесты по тематике и функциональности,
    и "не нужно создавать отдельный класс для каждого теста".

    Я понимаю это,
    но на доделывание этого проекта уйдет еще немало времени тогда, когда его и так не хватает: завтра начинается новый спринт,
    в котором тоже наверняка каждый день будет на счету.

                                                                              В другой ситуации я бы улучшил структуру,
                                                                                                              иерархию,
                                                                              но сейчас на это не хватает времени.

                                                  Надеюсь на понимание
     */
}
